org/Blog/Programming/a-lispy-interlude/index.org
#+TITLE: A Lispy Interlude
#+DATE: <2024-08-01 Thu>
#+OPTIONS: toc:2 

#+BEGIN_QUOTE
These are your father's parentheses, elegant weapons for a more civilized age - [[https://xkcd.com/297/][xkcd]]
#+END_QUOTE

----------------------------------------------------------------------------------------------------

* Intro
I've spent about a year with Lisp, specifically Common Lisp. 

I came to Lisp quite by accident. By chance I chose to try out Emacs (cargo cult style because Casey Muratori and Jonathan Blow use Emacs / I wanted to be /cool/ and use a different system than programmers around me (Vim)).

After the initial leap of faith, I stayed due to the lindy effect and the purported ability to completely extend/ customize Emacs.
(Who doesn't *hate* learning arbitrary pieces of software/ being dependent on mutable toolchains?)
As such, while trying to come to terms with the steep learning curve and starting to slowly customize my Emacs, I was exposed to Emacs Lisp.

This, combined with a burgeoning interest in functional programming (FP) at the time (I was motivated to pickup another language to try out a different paradigm in general)
Led me to study Lisp more fully. (A first irony as Lisp is unopinionated about programming paradigms)

Of the standard set of recommended languages to learn FP, Lisp was deeply interesting -- if only from the way people talked about it:
#+begin_quote
Lisp is worth learning for the profound enlightenment experience you will have when you finally get it; that experience will make you a better programmer for the rest of your days, even if you never actually use Lisp itself a lot."
-Eric Raymond
#+end_quote

After considering which Lisp (Lisp is a family of languages) to jump into, I settled on Common Lisp (CL) as it was the easiest to set up / seemed to have most resources (libraries, learning materials etc.)

Well, I assumed I had a pretty strong foundation in programming (I had been exposed to C, C++, Java, Python, and Javascript
(Matlab too if that counts, the syntax is supposed to emulate Fortran in a simplified/ dynamically typed way) and done a lot of graphics programming
at this point over the course of many years); to my surprise and dismay, I couldn't make heads or tails of the Common Lisp syntax.
(This seems to be a very common reaction for Lisp)
In a very basic way, I couldn't even declare or assign a simple variables, I couldn't understand how to return something from a function, nothing.

There seemed to be an overwhelming amount of specialized verbiage/ specialized syntax (another irony as Lisp has almost no syntax like the lambda caluclus at its core)
and anytime I messed around in a REPL I got compilation errors that I couldn't follow (more irony because CL fails so gracefully compared with most languages)

It felt like I was touching C++ or OpenGL again for the first time. Some convoluted, black box that didn't seem worth the effort.
I was very close to calling it quits, but the army of intelligent people talking about englightenment kept me going.

I understand now, after a lot of [[Reading][reading]] (Practical Common Lisp, ANSI Common Lisp, On Lisp mostly) and no small amount of suffering.
Maybe this small article can lessen some of that for the uninitiated and curious

I'm deeply impressed with the language and the lessons I've learned from it.


* Why?
** REPL/ image based development
The REPL (read-eval-print-loop) based environment is really something special. It's a highly ergonomic style of coding and lends itself to rapid idea iteration / maintaining flow.

Instead of write-compile-debug cycle, you can incrementally build interactively. You can compile functions, redefine classes, etc. all while the program is running
(hot reloads/ changing the internal state of the image). You don't have to restart a process and then re-create objects.
Compile the bit that you want or is not working and get instant feedback.
If something isn't working or you don't understand something, just hop over to your REPL and fix it or prove it to yourself. You can inspect trees of live values,
or rewind the stack to undo an exception.

