html/Articles/Programming/a-lispy-interlude/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Lispy Interlude</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta http-equiv="X-UA-Compatible" content="ie=edge">
<title>Blah</title>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css" integrity="sha512-1sCRPdkRXhBV2PBLUdRb4tMg1w2YPf37qatUFeS7zlBy7jJI8Lf4VHwWfZZfpXtYSLy85pkm9GaYVYMfw5BC1A==" crossorigin="anonymous" referrerpolicy="no-referrer">
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css">
</head>
<body>
<div id="preamble" class="status">
<header> <a href="https://ianstranathan.github.io/">Main</a> :: <a href="https://ianstranathan.github.io/Articles/">Articles</a> ::</header></header>
</div>
<div id="content" class="content">
<h1 class="title">A Lispy Interlude</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org042c641">Intro</a></li>
<li><a href="#org2ed3f29">Why?</a>
<ul>
<li><a href="#org20acdcf">REPL/ image based development</a></li>
<li><a href="#org2464c18">Macros</a></li>
<li><a href="#org00fe4e5">Other's opinions on why bother with Lisp</a></li>
</ul>
</li>
<li><a href="#org22329c7">Problems</a>
<ul>
<li><a href="#org4a56215">Why isn't Lisp more popular?</a></li>
</ul>
</li>
<li><a href="#org2e68003">Outro</a>
<ul>
<li><a href="#orga9519e6">Note on Common Lisp</a></li>
</ul>
</li>
<li><a href="#orge9957e7">Resources</a>
<ul>
<li><a href="#org7af7add">Setup:</a></li>
<li><a href="#org59ca02b">Reading</a></li>
<li><a href="#org59b9a92">Misc</a></li>
<li><a href="#org1d56414">Videos</a></li>
<li><a href="#orgcd175e7">Collected Opinions of others</a></li>
</ul>
</li>
</ul>
</div>
</div>
<blockquote>
<p>
These are your father's parentheses, elegant weapons for a more civilized age - <a href="https://xkcd.com/297/">xkcd</a>
</p>
</blockquote>

<hr />

<div id="outline-container-org042c641" class="outline-2">
<h2 id="org042c641">Intro</h2>
<div class="outline-text-2" id="text-org042c641">
<p>
I've spent about a year with Lisp, specifically Common Lisp. 
</p>

<p>
I came to Lisp quite by accident. By chance I chose to try out Emacs (cargo cult style because Casey Muratori and Jonathan Blow use Emacs / I wanted to be <i>cool</i> and use a different system than programmers around me (Vim)).
</p>

<p>
After the initial leap of faith, I stayed due to the lindy effect and the purported ability to completely extend/ customize Emacs.
(Who doesn't <b>hate</b> learning arbitrary pieces of software/ being dependent on mutable toolchains?)
As such, while trying to come to terms with the steep learning curve and starting to slowly customize my Emacs, I was exposed to Emacs Lisp.
</p>

<p>
This, combined with a burgeoning interest in functional programming (FP) at the time (I was motivated to pickup another language to try out a different paradigm in general)
Led me to study Lisp more fully. (A first irony as Lisp is unopinionated about programming paradigms)
</p>

<p>
Of the standard set of recommended languages to learn FP, Lisp was deeply interesting &#x2013; if only from the way people talked about it:
</p>
<blockquote>
<p>
Lisp is worth learning for the profound enlightenment experience you will have when you finally get it; that experience will make you a better programmer for the rest of your days, even if you never actually use Lisp itself a lot."
-Eric Raymond
</p>
</blockquote>

<p>
After considering which Lisp (Lisp is a family of languages) to jump into, I settled on Common Lisp (CL) as it was the easiest to set up / seemed to have most resources (libraries, learning materials etc.)
</p>

<p>
Well, I assumed I had a pretty strong foundation in programming (I had been exposed to C, C++, Java, Python, and Javascript
(Matlab too if that counts, the syntax is supposed to emulate Fortran in a simplified/ dynamically typed way) and done a lot of graphics programming
at this point over the course of many years); to my surprise and dismay, I couldn't make heads or tails of the Common Lisp syntax.
(This seems to be a very common reaction for Lisp)
In a very basic way, I couldn't even declare or assign a simple variables, I couldn't understand how to return something from a function, nothing.
</p>

<p>
There seemed to be an overwhelming amount of specialized verbiage/ specialized syntax (another irony as Lisp has almost no syntax like the lambda caluclus at its core)
and anytime I messed around in a REPL I got compilation errors that I couldn't follow (more irony because CL fails so gracefully compared with most languages)
</p>

<p>
It felt like I was touching C++ or OpenGL again for the first time. Some convoluted, black box that didn't seem worth the effort.
I was very close to calling it quits, but the army of intelligent people talking about englightenment kept me going.
</p>

<p>
I understand now, after a lot of <a href="#org59ca02b">reading</a> (Practical Common Lisp, ANSI Common Lisp, On Lisp mostly) and no small amount of suffering.
Maybe this small article can lessen some of that for the uninitiated and curious
</p>

<p>
I'm deeply impressed with the language and the lessons I've learned from it.
</p>
</div>
</div>


<div id="outline-container-org2ed3f29" class="outline-2">
<h2 id="org2ed3f29">Why?</h2>
<div class="outline-text-2" id="text-org2ed3f29">
</div>
<div id="outline-container-org20acdcf" class="outline-3">
<h3 id="org20acdcf">REPL/ image based development</h3>
<div class="outline-text-3" id="text-org20acdcf">
<p>
The REPL (read-eval-print-loop) based environment is really something special. It's a highly ergonomic style of coding and lends itself to rapid idea iteration / maintaining flow.
</p>

<p>
Instead of write-compile-debug cycle, you can incrementally build interactively. You can compile functions, redefine classes, etc. all while the program is running
(hot reloads/ changing the internal state of the image). You don't have to restart a process and then re-create objects.
Compile the bit that you want or is not working and get instant feedback.
If something isn't working or you don't understand something, just hop over to your REPL and fix it or prove it to yourself. You can inspect trees of live values,
or rewind the stack to undo an exception.
</p>
</div>
</div>
