org/Blog/Programming/a-lispy-interlude/index.org
** Macros
Lisp is called the programmable programming language.
It's fundamentally different from other languages because it runs in the same context it's written in,
i.e. it's written in the same form as running Lisp code which is the same as Lisp data (the so called s-expression).
Lisp's syntax, the hated parens, are a necessary result of this.

"you express programs directly in the parse trees that get built behind the scenes when other languages are parsed,
and these trees are made of lists, which are Lisp data structures."

It's ironic that Lisp's syntax is such a sticking point as it's actually a lack of syntax.
Everything is an expression, every expression gets evaluated, if you don't want it evaluated, you
put a quote on it.

Lisp is powerful because all Lisp programs are also Lisp data -– everything that can be run can be written (and read) in an s-expression.
This makes it possible to write Lisp code that reliably generates and transforms source code through the metaprogramming facility of macros:
programs that write programs, that write programs... s-expressions all the way down.

#+BEGIN_QUOTE
The whole language is there all the time. There is no real distinction between read-time, compile-time, and runtime.
You can compile or run code while reading, read or run code while compiling, and read or compile code at runtime.
Running code at read-time lets users reprogram Lisp's syntax; running code at compile-time is the basis of macros;
compiling at runtime is the basis of Lisp's use as an extension language in programs like Emacs;
and reading at runtime enables programs to communicate using s-expressions, an idea recently reinvented as XML. - [[https://www.paulgraham.com/icad.html][Paul Graham]]
#+END_QUOTE

This aspect is what people are talking about when they use hyperbolic terms like "enlightenment", or about the necessity of Lisp, that Lisp
isn't quite an invention, but rather is closer to a discovery.

#+begin_quote
Lisp isn't a language, it's a building material."
- Alan Kay
#+end_quote

#+begin_quote
"Lisp's core occupies some kind of local optimum in the space of programming languages"
- John McCarthy
#+end_quote

#+begin_quote
"Lisp is a minimal fixed point amongst programming languages.
It's not an invention, but a discovery.
That's why it won't just go away."
- Brian Beckman
#+end_quote

#+begin_quote
Part of what makes Lisp distinctive is that it is designed to evolve. As new abstractions become popular (object-oriented programming, for example),
it always turns out to be easy to implement them in Lisp. Like DNA, such a language does not go out of style.
- Pual Graham
#+end_quote

See these two articles for extended explaination (Short cut enlightenment! Life's too short)
https://dl.acm.org/doi/10.1145/3386330
https://stopa.io/post/265
https://www.defmacro.org/ramblings/Lisp.html

It would seem that Lisp is an expressiveness limit that a language can approach. Whether through s-expressions or [[https://medium.com/smalltalk-talk/Lisp-smalltalk-and-the-power-of-symmetry-8bd96aaa0c0c][not]]
Lisp transcends language features, by having a single language feature that lets you define language features

Lisp's strange syntax (lack of syntax), and its concomitant homoiconicity (expressing the language in its own data structures) creates this limiting behavior.
[[https://www.paulgraham.com/icad.html][One could argue]] that if you add this facility to a language, you can no longer claim to have invented a new language, but only a new dialect of Lisp.
Analogous maybe, but more funadamental, to how C is often described as a portable assembly language. If you change the abstraction layer at that low level, it's more
or less a syntactic isomorphism, you haven't really gained anything. A reason C is ubiquitous and hasn't really been replaced.

More fundamental, I think, because just like the Lambda Calculus it's based on, it exists in the abstract.
Lisp (see [[https://www.paulgraham.com/icad.html][Paul Graham]]) was originally intended as a theoretical exercise to "define a more convenient alternative to the Turing Machine".
"Lisp was a piece of theory that unexpectedly got turned into a programming language."


*** Practically speaking macros allow:
- Domain specific languages ([[https://www.paulgraham.com/progbot.html][bottom-up design]] in the words of Paul Graham)
  Lisp makes no assumption how to orient to this. Through its macro system, Lisp does not assume what syntax, features or functions will be necessary for the problem domain.
  Like list comprehensions from Python or Haskell, [[https://stackoverflow.com/questions/267862/what-makes-Lisp-macros-so-special][write a macro]]
  No need to wait for syntax extensions (e.g. waiting for Oracle to add for each semantics to Java) the language is naturally scultped to the problem.

- design patterns, higher levels of abstraction
  #+BEGIN_QUOTE
  Patterns mean "I have run out of language." - Rich Hickey
  #+END_QUOTE
- compile time computing / metaprogramming/ code generation & transformation
  Other languages have metaprogramming techniques, but they're neither as reliable nor powerful as Lisp (C and C++ examples
  [[http://lists.warhead.org.uk/pipermail/iwe/2005-July/000130.html][here]]; indeed, if they were as good, they would actually have to be a Lisp!)
  "To add object-orientation to C, Bjarne Stroustrup had to write a whole front-end called cfront which processed C++ into a mess of C
  that could be compiled.
  Lispers could do the same thing with macros (CLOS), without having to do the kind of parsing cfront had to do.
  Creating an OO extension to Lisp using something like message-passing is a single chapter textbook exercise using macros." ([[https://www.reddit.com/r/Lisp/comments/18823uj/i_dont_think_i_get_macros/][link]])
  #+BEGIN_QUOTE
  "Common Lisp macros are to C++ templates what poetry is to IRS tax forms."
  - Christian Schafmeister
  #+END_QUOTE
  
** Other's opinions on why bother with Lisp
[[https://gigamonkeys.com/book/introduction-why-Lisp.html][Peter Seibel, my first introduction to Common Lisp]]
https://atlas.engineer/technical-article/why-Lisp.org
http://ivy.io/common-Lisp/2015/03/03/guerilla-Lisp-opus.html

----------------------------------------------------------------------------------------------------

* Problems
Lisp remains an unpopular language ([[https://www.tiobe.com/tiobe-index/][relatively speaking]]). It will never be a good career move to invest in this language as far as I can tell.
I cannot understand why, save for a black swan event, Python is so popular and Common Lisp (or any industrial strength Lisp) is so fringe.
(See some old speed comparisons, among other things, from [[https://www.norvig.com/python-Lisp.html][Peter Norvig]])

