html/Articles/Programming/a-lispy-interlude/index.html

<div id="outline-container-org2464c18" class="outline-3">
<h3 id="org2464c18">Macros</h3>
<div class="outline-text-3" id="text-org2464c18">
<p>
Lisp is called the programmable programming language.
It's fundamentally different from other languages because it runs in the same context it's written in,
i.e. it's written in the same form as running Lisp code which is the same as Lisp data (the so called s-expression).
Lisp's syntax, the hated parens, are a necessary result of this.
</p>

<p>
"you express programs directly in the parse trees that get built behind the scenes when other languages are parsed,
and these trees are made of lists, which are Lisp data structures."
</p>

<p>
It's ironic that Lisp's syntax is such a sticking point as it's actually a lack of syntax.
Everything is an expression, every expression gets evaluated, if you don't want it evaluated, you
put a quote on it.
</p>

<p>
Lisp is powerful because all Lisp programs are also Lisp data -– everything that can be run can be written (and read) in an s-expression.
This makes it possible to write Lisp code that reliably generates and transforms source code through the metaprogramming facility of macros:
programs that write programs, that write programs&#x2026; s-expressions all the way down.
</p>

<blockquote>
<p>
The whole language is there all the time. There is no real distinction between read-time, compile-time, and runtime.
You can compile or run code while reading, read or run code while compiling, and read or compile code at runtime.
Running code at read-time lets users reprogram Lisp's syntax; running code at compile-time is the basis of macros;
compiling at runtime is the basis of Lisp's use as an extension language in programs like Emacs;
and reading at runtime enables programs to communicate using s-expressions, an idea recently reinvented as XML. - <a href="https://www.paulgraham.com/icad.html">Paul Graham</a>
</p>
</blockquote>

<p>
This aspect is what people are talking about when they use hyperbolic terms like "enlightenment", or about the necessity of Lisp, that Lisp
isn't quite an invention, but rather is closer to a discovery.
</p>

<blockquote>
<p>
Lisp isn't a language, it's a building material."
</p>
<ul class="org-ul">
<li>Alan Kay</li>
</ul>
</blockquote>

<blockquote>
<p>
"Lisp's core occupies some kind of local optimum in the space of programming languages"
</p>
<ul class="org-ul">
<li>John McCarthy</li>
</ul>
</blockquote>

<blockquote>
<p>
"Lisp is a minimal fixed point amongst programming languages.
It's not an invention, but a discovery.
That's why it won't just go away."
</p>
<ul class="org-ul">
<li>Brian Beckman</li>
</ul>
</blockquote>

<blockquote>
<p>
Part of what makes Lisp distinctive is that it is designed to evolve. As new abstractions become popular (object-oriented programming, for example),
it always turns out to be easy to implement them in Lisp. Like DNA, such a language does not go out of style.
</p>
<ul class="org-ul">
<li>Pual Graham</li>
</ul>
</blockquote>

<p>
See these two articles for extended explaination (Short cut enlightenment! Life's too short)
<a href="https://dl.acm.org/doi/10.1145/3386330">https://dl.acm.org/doi/10.1145/3386330</a>
<a href="https://stopa.io/post/265">https://stopa.io/post/265</a>
<a href="https://www.defmacro.org/ramblings/Lisp.html">https://www.defmacro.org/ramblings/Lisp.html</a>
</p>

<p>
It would seem that Lisp is an expressiveness limit that a language can approach. Whether through s-expressions or <a href="https://medium.com/smalltalk-talk/Lisp-smalltalk-and-the-power-of-symmetry-8bd96aaa0c0c">not</a>
Lisp transcends language features, by having a single language feature that lets you define language features
</p>

<p>
Lisp's strange syntax (lack of syntax), and its concomitant homoiconicity (expressing the language in its own data structures) creates this limiting behavior.
<a href="https://www.paulgraham.com/icad.html">One could argue</a> that if you add this facility to a language, you can no longer claim to have invented a new language, but only a new dialect of Lisp.
Analogous maybe, but more funadamental, to how C is often described as a portable assembly language. If you change the abstraction layer at that low level, it's more
or less a syntactic isomorphism, you haven't really gained anything. A reason C is ubiquitous and hasn't really been replaced.
</p>

<p>
More fundamental, I think, because just like the Lambda Calculus it's based on, it exists in the abstract.
Lisp (see <a href="https://www.paulgraham.com/icad.html">Paul Graham</a>) was originally intended as a theoretical exercise to "define a more convenient alternative to the Turing Machine".
"Lisp was a piece of theory that unexpectedly got turned into a programming language."
</p>
</div>


<div id="outline-container-orgf017d3d" class="outline-4">
<h4 id="orgf017d3d">Practically speaking macros allow:</h4>
<div class="outline-text-4" id="text-orgf017d3d">
<ul class="org-ul">
<li>Domain specific languages (<a href="https://www.paulgraham.com/progbot.html">bottom-up design</a> in the words of Paul Graham)
Lisp makes no assumption how to orient to this. Through its macro system, Lisp does not assume what syntax, features or functions will be necessary for the problem domain.
Like list comprehensions from Python or Haskell, <a href="https://stackoverflow.com/questions/267862/what-makes-Lisp-macros-so-special">write a macro</a>
No need to wait for syntax extensions (e.g. waiting for Oracle to add for each semantics to Java) the language is naturally scultped to the problem.</li>

<li><p>
design patterns, higher levels of abstraction
</p>
<blockquote>
<p>
Patterns mean "I have run out of language." - Rich Hickey
</p>
</blockquote></li>
<li><p>
compile time computing / metaprogramming/ code generation &amp; transformation
Other languages have metaprogramming techniques, but they're neither as reliable nor powerful as Lisp (C and C++ examples
<a href="http://lists.warhead.org.uk/pipermail/iwe/2005-July/000130.html">here</a>; indeed, if they were as good, they would actually have to be a Lisp!)
"To add object-orientation to C, Bjarne Stroustrup had to write a whole front-end called cfront which processed C++ into a mess of C
that could be compiled.
Lispers could do the same thing with macros (CLOS), without having to do the kind of parsing cfront had to do.
Creating an OO extension to Lisp using something like message-passing is a single chapter textbook exercise using macros." (<a href="https://www.reddit.com/r/Lisp/comments/18823uj/i_dont_think_i_get_macros/">link</a>)
</p>
<blockquote>
<p>
"Common Lisp macros are to C++ templates what poetry is to IRS tax forms."
</p>
<ul class="org-ul">
<li>Christian Schafmeister</li>
</ul>
</blockquote></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org00fe4e5" class="outline-3">
<h3 id="org00fe4e5">Other's opinions on why bother with Lisp</h3>
<div class="outline-text-3" id="text-org00fe4e5">
<p>
<a href="https://gigamonkeys.com/book/introduction-why-Lisp.html">Peter Seibel, my first introduction to Common Lisp</a>
<a href="https://atlas.engineer/technical-article/why-Lisp.org">https://atlas.engineer/technical-article/why-Lisp.org</a>
<a href="http://ivy.io/common-Lisp/2015/03/03/guerilla-Lisp-opus.html">http://ivy.io/common-Lisp/2015/03/03/guerilla-Lisp-opus.html</a>
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-org22329c7" class="outline-2">
<h2 id="org22329c7">Problems</h2>
<div class="outline-text-2" id="text-org22329c7">
<p>
Lisp remains an unpopular language (<a href="https://www.tiobe.com/tiobe-index/">relatively speaking</a>). It will never be a good career move to invest in this language as far as I can tell.
I cannot understand why, save for a black swan event, Python is so popular and Common Lisp (or any industrial strength Lisp) is so fringe.
(See some old speed comparisons, among other things, from <a href="https://www.norvig.com/python-Lisp.html">Peter Norvig</a>)
</p>
</div>
