org/Blog/Programming/a-lispy-interlude/index.org
** Why isn't Lisp more popular?

- _[[https://www.youtube.com/watch?v=_J3x5yvQ8yc][The curse of Lisp]]_
  
- _No advocating group_ (Benevolent Dictator For Life, Oracle like company, etc.)
  
- _[[https://www.dreamsongs.com/WorseIsBetter.html][Worse is better]]_
  
- _Linguistic imperialism_ (ALGOL descendence)
  Why is English the lingua franca of our time? (Why is the by-word for such a thing called lingua franca)
  
- _The Mathew principle_ (Libraries, learning resources):
  The ecosystem is worse than the dominating languages => Vicious cycle, not enough resources (libraries, learning resources etc.) exist because not enough people are using the language;
  no one wants to use the language because there aren't enough resources.
  Everything is give and take however -- an advantage of this situation is that the resources that do exist are very high quality. The people who are active in the
  commuinity aren't freshly minted devs from a coding bootcamped looking for their senior position in JS.
  
- *Not everyone can be Jedis*

[[https://norvig.com/Lisp-retro.html][Peter Norvig's take]]

----------------------------------------------------------------------------------------------------

* Outro
#+begin_quote
Lisp has assisted a number of our most gifted fellow humans in thinking previously impossible thoughts.
- Edsger Dijkstra
#+end_quote

As talked about in more detail in the already referenced essay [[https://www.paulgraham.com/icad.html][Revenge of the Nerds]] by Paul Graham,
"Over time, the default language, embodied in a succession of popular languages, has gradually evolved toward Lisp"
Most modern languages (or the predominately used subsets of those languages) look more like Lisp than not.
Python, despite its Algol inherited syntax is more Lisp-like than its actual ancestor.
(Even more on the nose, as discussed in the above essay, modern Fortran is more Lisp like than Fortan like; Fortran and Lisp representing the big evolutionary
bifurcation in programming languages)

Lisp hasn't so much died out as melded with modern languages (I think this is the more common evolutionary trajectory rather than extinction.
eurasian humans are 1-4% Neanderthal supposedly, the original Blub languages (Fortran) being the Neanderthals of course).
Still, macros, as discussed toward the beginning, are a structural dilineation.
Many languages have higher order functions, garbage collection, recursion and so on (see "Revenge of the Nerds"), but they can't cross that threshold without
becoming and isomorphism to lisp, another dialect.

As such, there are still unique rewards to studying Lisp (philosophical and technical).
There are also associated costs to be paid for using uncommon/ non-"standard" technologes, emphatically, *there is no practical or commerical application to learning Lisp.*
Hoever, for me the juice was worth the sequeeze:

- A different perspective / breaking out of the ALGOL world (C, C++, Java, C# and Python personally)
  Beyond syntax, macro/ metaprogramming is so different than the paradigms I had seen before.
  
- A better ability to code using recursion as an iterative technique.
(As long as a compiler is tail call optimized (See this [[https://www.youtube.com/watch?v=SPri4PTUY_8][excellent explaination]] if TCO is confusing to you), I think recursion should be used more often;
it often fits the problem better, is smaller, less mental/ complexity management and is almost always more elegant)

- Deeper understanding of functional programming/ closure oriented programming
  (Lisp is _not_ strictly functional. But there is a reason why s-expressions resemble Lambda calculus so much and a lot of resources are written
  in a fucntional style)

- Life long Emacs
  
These points won't spin the world the other way, but they have _made me a better programmer_ and this was the goal all along.

Good luck, have fun!

** Note on Common Lisp
I chose to learn Common Lisp between the dominant Lisps (e.g. Common Lisp, scheme, Emacs Lisp, clojure) and would retrospectively recommend against it (at least initially) for a beginner.
Common Lisp is a language designed around being able to write macros (Lisp-1 vs. Lisp-2)
For a beginner coming from a more C-like world, coming to grips with the syntax is
needlessly made harder due to Common Lisp being a relatively "big" language. (A lot of utility  macros written in portable Common Lisp; i.e. a standard library)
By definition, macros can violate the syntax rules (or lack there of) and, when told while learning that everything is a function return (s-expression), it seems
convoluted and confusing.
To this end, Scheme seems like a much better choice to learn. The syntax carry-over will be pretty seamless and then the student can start on macros with CL's distinguished name spaces


----------------------------------------------------------------------------------------------------

* Resources
** Setup:
_Emacs + SLIME + SBCL_
Emacs is a text editor that is itself a Lisp system (Lisp intepreter that just happens to emphasize text editing)
This makes the editor as customizable and programmable as any other Lisp system; and most editor extensions are in fact Emacs Lisp programs that get loaded into a running editor to add their functionalit

SLIME is a Lisp development tool that comes in two parts: one is an Emacs Lisp program, the other is a Common Lisp program.
The two halves communicate via a protocol called SWANK and provide lots of helpful features that make Lisp development easier (function signature completions for exmaple)
(SLIME: Emacs addon, a client that sends commands from Emacs to a Common Lisp language server (SWANK); SWANK executes client commands, running on your chosen Common Lisp e.g. SBCL)

** Reading
*** My recommended learning resources (in order)
- Practical Common Lisp
- ANSI Common Lisp
- On Lisp (Recommended to start understanding macros)
- Common Lisp Recipes
- Programming Algorithms in Lisp
- Let over Lambda (Recommended after "On Lisp")

*** Collected learning resources
- The Structure and Interpretation of Computer Programs
- Paradigms of Artificial Intelligence
- The Schemer Series (Little, Seasoned, Reasoned)
- Essentials of Programming Languages
- Concrete Abstractions
  
*** Lisp compilers and interpreters
- Lisp in Small Pieces
- Lisp from Nothing

