html/Articles/Programming/a-lispy-interlude/index.html

<div id="outline-container-org4a56215" class="outline-3">
<h3 id="org4a56215">Why isn't Lisp more popular?</h3>
<div class="outline-text-3" id="text-org4a56215">
<ul class="org-ul">
<li><span class="underline"><a href="https://www.youtube.com/watch?v=_J3x5yvQ8yc">The curse of Lisp</a></span></li>

<li><span class="underline">No advocating group</span> (Benevolent Dictator For Life, Oracle like company, etc.)</li>

<li><span class="underline"><a href="https://www.dreamsongs.com/WorseIsBetter.html">Worse is better</a></span></li>

<li><span class="underline">Linguistic imperialism</span> (ALGOL descendence)
Why is English the lingua franca of our time? (Why is the by-word for such a thing called lingua franca)</li>

<li><span class="underline">The Mathew principle</span> (Libraries, learning resources):
The ecosystem is worse than the dominating languages =&gt; Vicious cycle, not enough resources (libraries, learning resources etc.) exist because not enough people are using the language;
no one wants to use the language because there aren't enough resources.
Everything is give and take however &#x2013; an advantage of this situation is that the resources that do exist are very high quality. The people who are active in the
commuinity aren't freshly minted devs from a coding bootcamped looking for their senior position in JS.</li>

<li><b>Not everyone can be Jedis</b></li>
</ul>

<p>
<a href="https://norvig.com/Lisp-retro.html">Peter Norvig's take</a>
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-org2e68003" class="outline-2">
<h2 id="org2e68003">Outro</h2>
<div class="outline-text-2" id="text-org2e68003">
<blockquote>
<p>
Lisp has assisted a number of our most gifted fellow humans in thinking previously impossible thoughts.
</p>
<ul class="org-ul">
<li>Edsger Dijkstra</li>
</ul>
</blockquote>

<p>
As talked about in more detail in the already referenced essay <a href="https://www.paulgraham.com/icad.html">Revenge of the Nerds</a> by Paul Graham,
"Over time, the default language, embodied in a succession of popular languages, has gradually evolved toward Lisp"
Most modern languages (or the predominately used subsets of those languages) look more like Lisp than not.
Python, despite its Algol inherited syntax is more Lisp-like than its actual ancestor.
(Even more on the nose, as discussed in the above essay, modern Fortran is more Lisp like than Fortan like; Fortran and Lisp representing the big evolutionary
bifurcation in programming languages)
</p>

<p>
Lisp hasn't so much died out as melded with modern languages (I think this is the more common evolutionary trajectory rather than extinction.
eurasian humans are 1-4% Neanderthal supposedly, the original Blub languages (Fortran) being the Neanderthals of course).
Still, macros, as discussed toward the beginning, are a structural dilineation.
Many languages have higher order functions, garbage collection, recursion and so on (see "Revenge of the Nerds"), but they can't cross that threshold without
becoming and isomorphism to lisp, another dialect.
</p>

<p>
As such, there are still unique rewards to studying Lisp (philosophical and technical).
There are also associated costs to be paid for using uncommon/ non-"standard" technologes, emphatically, <b>there is no practical or commerical application to learning Lisp.</b>
Hoever, for me the juice was worth the sequeeze:
</p>

<ul class="org-ul">
<li>A different perspective / breaking out of the ALGOL world (C, C++, Java, C# and Python personally)
Beyond syntax, macro/ metaprogramming is so different than the paradigms I had seen before.</li>

<li>A better ability to code using recursion as an iterative technique.</li>
</ul>
<p>
(As long as a compiler is tail call optimized (See this <a href="https://www.youtube.com/watch?v=SPri4PTUY_8">excellent explaination</a> if TCO is confusing to you), I think recursion should be used more often;
it often fits the problem better, is smaller, less mental/ complexity management and is almost always more elegant)
</p>

<ul class="org-ul">
<li>Deeper understanding of functional programming/ closure oriented programming
(Lisp is <span class="underline">not</span> strictly functional. But there is a reason why s-expressions resemble Lambda calculus so much and a lot of resources are written
in a fucntional style)</li>

<li>Life long Emacs</li>
</ul>

<p>
These points won't spin the world the other way, but they have <span class="underline">made me a better programmer</span> and this was the goal all along.
</p>

<p>
Good luck, have fun!
</p>
</div>

<div id="outline-container-orga9519e6" class="outline-3">
<h3 id="orga9519e6">Note on Common Lisp</h3>
<div class="outline-text-3" id="text-orga9519e6">
<p>
I chose to learn Common Lisp between the dominant Lisps (e.g. Common Lisp, scheme, Emacs Lisp, clojure) and would retrospectively recommend against it (at least initially) for a beginner.
Common Lisp is a language designed around being able to write macros (Lisp-1 vs. Lisp-2)
For a beginner coming from a more C-like world, coming to grips with the syntax is
needlessly made harder due to Common Lisp being a relatively "big" language. (A lot of utility  macros written in portable Common Lisp; i.e. a standard library)
By definition, macros can violate the syntax rules (or lack there of) and, when told while learning that everything is a function return (s-expression), it seems
convoluted and confusing.
To this end, Scheme seems like a much better choice to learn. The syntax carry-over will be pretty seamless and then the student can start on macros with CL's distinguished name spaces
</p>


<hr />
</div>
</div>
</div>

<div id="outline-container-orge9957e7" class="outline-2">
<h2 id="orge9957e7">Resources</h2>
<div class="outline-text-2" id="text-orge9957e7">
</div>
<div id="outline-container-org7af7add" class="outline-3">
<h3 id="org7af7add">Setup:</h3>
<div class="outline-text-3" id="text-org7af7add">
<p>
<span class="underline">Emacs + SLIME + SBCL</span>
Emacs is a text editor that is itself a Lisp system (Lisp intepreter that just happens to emphasize text editing)
This makes the editor as customizable and programmable as any other Lisp system; and most editor extensions are in fact Emacs Lisp programs that get loaded into a running editor to add their functionalit
</p>

<p>
SLIME is a Lisp development tool that comes in two parts: one is an Emacs Lisp program, the other is a Common Lisp program.
The two halves communicate via a protocol called SWANK and provide lots of helpful features that make Lisp development easier (function signature completions for exmaple)
(SLIME: Emacs addon, a client that sends commands from Emacs to a Common Lisp language server (SWANK); SWANK executes client commands, running on your chosen Common Lisp e.g. SBCL)
</p>
</div>
</div>

<div id="outline-container-org59ca02b" class="outline-3">
<h3 id="org59ca02b">Reading</h3>
<div class="outline-text-3" id="text-org59ca02b">
</div>
<div id="outline-container-orga42cb71" class="outline-4">
<h4 id="orga42cb71">My recommended learning resources (in order)</h4>
<div class="outline-text-4" id="text-orga42cb71">
<ul class="org-ul">
<li>Practical Common Lisp</li>
<li>ANSI Common Lisp</li>
<li>On Lisp (Recommended to start understanding macros)</li>
<li>Common Lisp Recipes</li>
<li>Programming Algorithms in Lisp</li>
<li>Let over Lambda (Recommended after "On Lisp")</li>
</ul>
</div>
</div>

<div id="outline-container-orgdf4c52c" class="outline-4">
<h4 id="orgdf4c52c">Collected learning resources</h4>
<div class="outline-text-4" id="text-orgdf4c52c">
<ul class="org-ul">
<li>The Structure and Interpretation of Computer Programs</li>
<li>Paradigms of Artificial Intelligence</li>
<li>The Schemer Series (Little, Seasoned, Reasoned)</li>
<li>Essentials of Programming Languages</li>
<li>Concrete Abstractions</li>
</ul>
</div>
</div>

<div id="outline-container-org760e7df" class="outline-4">
<h4 id="org760e7df">Lisp compilers and interpreters</h4>
<div class="outline-text-4" id="text-org760e7df">
<ul class="org-ul">
<li>Lisp in Small Pieces</li>
<li>Lisp from Nothing</li>
</ul>
</div>
</div>
</div>
