org/Blog/Programming/a-lispy-interlude/index.org
** Misc
[[https://www.grammarly.com/blog/engineering/running-Lisp-in-production/][Vsevold Dyomkin]] (Author of "Programming Algorithms in Lisp" above)

[[https://github.com/CodyReichert/awesome-cl][awsome-cl]]

Great collection of articles on macros
https://maLisper.me/

Compile time computing
https://medium.com/@MartinCracauer/a-gentle-introduction-to-compile-time-computing-part-1-d4d96099cea0

The Roots of Lisp
https://www.paulgraham.com/rootsofLisp.html

Lisp in 99 lines of C
https://github.com/Robert-van-Engelen/tinyLisp

*** Erik Naggum: man, myth, legend.
[[https://www.xach.com/naggum/articles/3092837184154309@naggum.no.html][On the primacy of the list]]

** Videos
[[https://www.youtube.com/watch?v=5Kg7gC1YcWs][Exercism recap of Lisp and various Lisp dialects]]
[[https://www.youtube.com/@CBaggers/videos][Baggers]]
[[https://www.youtube.com/playlist?list=PL2VAYZE_4wRKKr5pJzfYD1w4tKCXARs5y][Bagger's Lispy OpenGL -- CEPL]]
(These videos, specifically "Little bits of Lisp" were what initially got me over the setup/ starting hurdle. Thank you baggers)

[[https://www.youtube.com/watch?v=_B_4vhsmRRI][Slime Tutorial]]
[[https://vimeo.com/77004324][Debugging Tutorial]]

