html/Articles/Programming/a-lispy-interlude/index.html


<div id="outline-container-org59b9a92" class="outline-3">
<h3 id="org59b9a92">Misc</h3>
<div class="outline-text-3" id="text-org59b9a92">
<p>
<a href="https://www.grammarly.com/blog/engineering/running-Lisp-in-production/">Vsevold Dyomkin</a> (Author of "Programming Algorithms in Lisp" above)
</p>

<p>
<a href="https://github.com/CodyReichert/awesome-cl">awsome-cl</a>
</p>

<p>
Good collection of articles on macros
<a href="https://malisper.me/">https://malisper.me/</a>
</p>

<p>
Compile time computing
<a href="https://medium.com/@MartinCracauer/a-gentle-introduction-to-compile-time-computing-part-1-d4d96099cea0">https://medium.com/@MartinCracauer/a-gentle-introduction-to-compile-time-computing-part-1-d4d96099cea0</a>
</p>

<p>
The Roots of Lisp
<a href="https://www.paulgraham.com/rootsofLisp.html">https://www.paulgraham.com/rootsofLisp.html</a>
</p>

<p>
Lisp in 99 lines of C
<a href="https://github.com/Robert-van-Engelen/tinyLisp">https://github.com/Robert-van-Engelen/tinyLisp</a>
</p>
</div>

<div id="outline-container-org17dd167" class="outline-4">
<h4 id="org17dd167">Erik Naggum: man, myth, legend.</h4>
<div class="outline-text-4" id="text-org17dd167">
<p>
<a href="https://www.xach.com/naggum/articles/3092837184154309@naggum.no.html">On the primacy of the list</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org1d56414" class="outline-3">
<h3 id="org1d56414">Videos</h3>
<div class="outline-text-3" id="text-org1d56414">
<p>
<a href="https://www.youtube.com/@CBaggers/videos">Baggers</a>
<a href="https://www.youtube.com/playlist?list=PL2VAYZE_4wRKKr5pJzfYD1w4tKCXARs5y">Bagger's Lispy OpenGL &#x2013; CEPL</a>
(These videos, specifically "Little bits of Lisp" were what initially got me over the setup/ starting hurdle. Thank you baggers)
</p>

<p>
<a href="https://www.youtube.com/watch?v=_B_4vhsmRRI">Slime Tutorial</a>
<a href="https://vimeo.com/77004324">Debugging Tutorial</a>
</p>
</div>
</div>
