org/Blog/Programming/a-lispy-interlude/index.org
** Collected Opinions of others

[[https://insearchofsecrets.com/2014/08/04/Lisp-smalltalk-and-the-power-of-symmetry/][Lisp, Smalltalk & the power of Symmetry]]

# -- Giant post from reddit
#+BEGIN_EXPORT html
  <details>
  <summary><a href="https://www.reddit.com/r/Lisp/comments/vogjl2/Lisp_didnt_add_any_value_to_my_life/">Giga-post from reddit</a></summary>
  <p>
  https://groups.google.com/g/comp.lang.Lisp/c/oSslA8mJdho?pli=1
  Google for Lisp at the JPL, https://news.ycombinator.com/item?id=2212211 https://thenewstack.io/nasa-programmer-remembers-debugging-Lisp-in-deep-space/

  A Lisp implementation running on a spacecraft where a bug was debugged live on the craft using a remote repl

guerilla Lisp opus.
https://groups.google.com/g/comp.lang.Lisp/c/HULKDUj_mBA/m/-UKK60tFz4YJ Characterize your problem in an abstract syntax that you make up as you go and suddenly you end up with a powerful compiler

Google cbaggers and cepl Live coding open GL graphics programming. He even wrote his slide presentation software in it so that he can live code in front of you while giving presentations

https://youtu.be/PqwuIfl-G1w Live coding with music

I've heard that in Lisp environments of old you were able to live code a GUI. So imagine while you're developing an application it gets complicated enough that you load a database and make changes to the data and click all these menus and now you want to debug some function. With Lisp you can load the whole state of the application get to that menu and experiment with and debug the dialog you're clicking on. You can keep the application state alive while iterating on your dialog without having to close the program and open it again and set up the state each time you want to make a change and test. You can even get live feedback from stakeholders as you demonstrate your app.

This extends from the idea that you have a terminal that allows you to make changes to a running program. Imagine that you have a code path that turns out to be begging for memoization. You can iterate and test live in the app with A copy of production data, and when you're satisfied with your memoization implementation you can swap the functions definition with yours that calls the original whenever it needs a new value while the program is running and suddenly your change is live. Is this a great way to develop software at scale? Maybe not, there is a trade-off to be made when it is easy to make changes in a rebel that you forget to capture, it can be a little confusing to back your way out and save the changes you tested. Getting around this is just a matter of learning good practices. Try doing this in any other language.

When you consider that it took languages like C++ and Java years and years and years to add things like foreach loops, not only was it out of the box in Lisp to begin with but it becomes a simple macro. You can build object oriented language support using macros alone, and while it might not necessarily be fast, look what happened when someone added object oriented programming support for C. It became the abortion you see today.

Along the same lines, since common list has a standard and the standard hasn't been updated since it was released, you don't have to worry about the Python 2 to Python 3 problem, you don't have to wait for a new standard to come out to support some new functionality, you don't have to deal with the various versions of C++, code that was written 20 years ago will just work.

https://atlas.engineer/technical-article/why-Lisp.org

C++ template meta programming is truly contrived and dizzying. It is a powerful tool that is very complex. And it basically constitutes a whole new syntax for compile time optimization and programming. Meanwhile in Lisp the language of compile time computing is the same as runtime computing. It's the same language, it just runs at a different time. Once you're familiar with programming and Lisp you are then familiar with how to program code that runs a compile time, yes they're slightly more involved in understanding the mental model however the learning curve is significantly less steep.

How many different languages do you need in order to write a C++ program? Make/cmake/catkin/colcon/Conan/ninja just to get it to build in link, The language itself, The m4 macro pre-processor, and the cluster that is template metaprogramming.

In Common Lisp, it is Lisp all the way down.

Try writing a binary serialization framework in C++ without resorting to code generation in Python. I think this was only finally possible in C++ 17 if that.

This is why I love this language

Edit: I forgot to mention syntax. In JavaScript do you frequently use every closing brace and semicolon when ending a function that has a lambda callback.

A long time ago I asked Ron Garret, the author of the JPL article, about his experience in more depth. To paraphrase he said I don't consider myself a very strong programmer, so with Lisp I was able to do great things with reduced cognitive load.

2nd Edit: oh! And typing! If you turn on optimization support, SBCL will give you very relevant hints about what it can and cannot optimize for you and how you can go about rewriting things and specifying types so that it can do the optimization for you. Every Common Lisp implementation supports generating disassembly for a given function so you can see the effects of your changes. You can put types where you need them, when you need them, and don't have to worry about potentially getting stuck later down the road because you had to decide about types before you knew more about your domain problems.

Oh, and multiple inheritance with multiple dispatch. Design and object hierarchy that allows you to represent the sound that is made between two objects that are struck together. Does one object take the other in a "clap" method? If you have a drum, a table, and a door on one side, and a drumstick, a drinking glass, and your knuckles on the other, try to write something that allows you to represent the sound between all of the combinations of these. Maybe you can work something out like that, but then what happens when you want to combine the sound of three different objects?....

With multiple dispatch you can design the objects independently and have a method that dispatches on the types of both inputs. Write one generic function, clap, that takes two arguments. The method that is called is dispatched on the types of both arguments. So you have (clap drum hand) and (clap knuckle door). None of these classes needs to know anything about the others. And frankly don't necessarily need to have a unified interface among them either, each method combination can use the specific implementations of those objects,. The objects don't need to be related in any way shape or form although they often would be because of the nature of the domain. If you suddenly have a new object somebody wrote from some other library that isn't related to your class hierarchy, as long as it gives you the information necessary to determine how to resolve the clap, just write that specific method.

Can't do that in C++

Edit 3:. When you've got the running image the way you want, you can dump the image to disk. This saves the data you've been messing with, functions and variables etc. Os resource handles go away of course. But if you have a lot of compile time code that makes startup take a while, your can do this work once and save the image. When you want too use it again you load it up and everything is the way you left it (with exceptions).

Going beyond this, your can change the function the is called at image startup. Instead of being the repl, it can be for own "main" function. Suddenly, you have a self contained shippable binary.

Can't do that in Python

Edit 4: when you can bring all of the above to bear as a configuration language for your editor (Emacs) you get wonders like magit mode for git and org mode etc. I mean come on! Every editor can be extended in some way. But the fact that Emacs is basically itself an (Emacs) Lisp program means that it reads Lisp code as both configuration state as well as functionality. You even get a repl, where you can modify the state of the editor by evaluating Lisp code. And guess what? You can DEBUG Emacs as you use it! Add breakpoints on a specific function on exit, or error, and you land in a back trace you can step through, navigate to relevant code, etc,. WHILE USING THE APP.

That's the power of Lisp baby

Edit X: I was trying to process a large amount of data on a server and the link was slow. I ended up pushing ccl to the server and fired up swank over ssh. I connected slime to the ssh tunnel and coded up my processing remotely. I read small bits of the data stream in, experimented with how I wanted to process it. Once I realized I needed to pull in some Lisp libraries from quickLisp, I issued Quickload on my machine, configured swank to start, dumped image, shipped it, and then connected over ssh. All the dependencies are in the image. I got my reports, and just for fun, dumped the image so that the main report loop ran when executed, and viola, my coworkers could rerun my program themselves.

Do this in any other language. In Python the furthest you get are virtual envs to match specific dependencies between systems, but forget about the rest

This experience is unparalleled as far as I know. I'm happy to be proven wrong.

Edit: and SIMD just landed on SBCL! https://www.sbcl.org/manual/index.html#sb_002dsimd

Edit: added links

Edit: How can I forget DART https://en.wikipedia.org/wiki/Dynamic_Analysis_and_Replanning_Tool 10 weeks from 0 to working prototype to revamp Army logistics leading up to Operation Desert Storm. I remember reading somewhere that it can be argued that the operation was delayed until the working prototype was successfully demonstrated, due to the fact that there had been disastrous logistics issues driving the need for the tool. The development process alone looks like an early version of agile done right, and also within 4 years the cost savings to the DoD had already more than paid back the investment in AI made over the prior 30 years.
</p>
</details>
#+END_EXPORT

# -- physics guy from quora
#+BEGIN_EXPORT html
<details>
<summary><strong> Gary Hollis via Quora</strong></summary>
<p>
I started learning C++ to do physics research.
While learning C++, I explored computer science in general and came across lots of praise and advice to try functional
programming and Common Lisp specifically.
I read Paul Graham’s articles, got one of his books, and started excitedly exploring Common Lisp.
What I found was that the learning curve of Common Lisp for me as beginner programmer was so steep
that I quit studying it fairly quickly and went back to focusing on C++ to get work done.

After a few years of getting skilled at C++, I became interested in functional programming again and
stumbled on Haskell, which I excitedly studied and used to solve some interesting mathematical problems and
play with competitive programming challenges. I then got the idea to use Haskell for physics research, since
it had some clear advantages and the potential for easy parallelization, and my physics research was full
of embarrassingly parallel problems that would be easy to write as reduction-map-filter combinations. However, at
the time I was exploring Haskell, my benchmarks put Haskell a few factors too slow
for practical use in analyzing data.
No doubt an expert could have massaged Haskell into running in an acceptable time, but
from the stats I saw at the time it would have cost at least 2x run time performance, and
when it already took a weekend to get back results, I did not like the
prospect of a 4-day wait time to get results back just so I could use a cool new language.

So yet again I was back to C++, and I used it until I stumbled on the old Lisp book I bought years ago. I had the idea to explore Common Lisp again, having reached a higher level of programming ability, and this time it stuck. I was using Lisp to solve problems and even get below the 2x performance gap with C++, which incentivized more exploration. Ultimately I built a data analysis framework that leveraged Lisp’s metaprogramming and code-as-data features to a good degree, leading to a kind of Make-like programming environment where targets can be defined separately and then merged into parallel computing tasks. Once I ran into a final performance wall, I added a module to this Make-like system that would generate, compile, and run C++ code for those combinations of tasks that needed to run on a compute cluster with high efficiency. This system included automatic job submission, download, and resubmit in the case of errors with the compute cluster job management system, so that to me, it didn’t matter that C++ code was generated and sent remotely to execute; it might as well have been executed locally as some kind of Lisp operation.
To conclude, I highly recommend Common Lisp as a language.
It provides abilities that no other language has yet to fully emulate, but it also has a very steep learning curve compared to other options. I don’t recommend committing to scaling that learning curve for a beginner for the same reason I don’t recommend a new hiker trying to climb Everest. Take a look at it, and explore the base of the summit as much as you like when you’re not training to climb progressively higher hills and take longer hikes. You’ll have a better feeling about Everest once you’ve trained adequately for it.
  </p>
</details>
#+END_EXPORT



